int/resources/objectRepo/xmlTemplates/htng/HTNG2008BExt/req_FetchHouseKeepingTask.xml

<soapenv:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://webservices.micros.com/htng/2008B/SingleGuestItinerary/Housekeeping/Types" xmlns:typ1="http://htng.org/PWS/2008B/SingleGuestItinerary/Common/Types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:FetchHouseKeepingTaskRequest>
         <typ:ResortId/>
         <typ:GenerateTask/>
         <typ:NoOfAttendants/>
         <typ:TaskCode/>
         <typ:RoomStatus/>
		 <typ:RoomStatus/>
         <typ:FOStatus/>
         <typ:SortBy/>
         <typ:MaxCredit/>
         <typ:TaskInstruction/>
         <typ:RoomInstruction/>
         <typ:DayOrEvening/>
         <typ:VIPCodesToExclude/>
         <typ:ExcludeCheckOutDateTimeRange>
            <typ1:Start/>
            <typ1:End/>
         </typ:ExcludeCheckOutDateTimeRange>
         <typ:ResvStatus/>
		 <typ:ResvStatus/>
         <typ:IncludeVipOnly/>
         <typ:ExcludeOwnerRoom/>
         <typ:ExcludeOwnerOccupiedRoom/>
         <typ:FetchDate/>
      </typ:FetchHouseKeepingTaskRequest>
   </soapenv:Body>
</soapenv:Envelope>